app/views/food_items/index.html.erb

SELECT COUNT(*) FROM "orders" WHERE "orders"."food_item_id" = $1  [["food_item_id", 2]]
---
        <td><%= image_tag food_item.image_url_or_auto %></td>
        <td><%= food_item.orders.count %></td>