app/views/food_items/show.html.erb

            <div class="card comments">
                <% @food_item.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."food_item_id" = $1  [["food_item_id", 2]]