app/controllers/menu_controller.rb

  def index
  	@sections = %w(Breakfast Lunch Dinner Drinks)
  	@orders = ["A->Z", "Date Ascending", "Date Descending"]
  	if (params[:order] == "Date Ascending")
  		@food_items = FoodItem.filter_by_section(params[:section]).order(created_at: :asc).page(params[:page]).per(5)
  	elsif (params[:order] == "Date Descending")
  		@food_items = FoodItem.filter_by_section(params[:section]).order(created_at: :desc).page(params[:page]).per(5)
  	else
  		@food_items = FoodItem.filter_by_section(params[:section]).order('name ASC').page(params[:page]).per(5)
---
SELECT  "food_items".* FROM "food_items" WHERE (section ILIKE '%Breakfast%')  ORDER BY "food_items"."created_at" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "food_items" WHERE (section ILIKE '%%')
SELECT  "food_items".* FROM "food_items" WHERE (section ILIKE '%%')  ORDER BY name ASC LIMIT 5 OFFSET 0