app/controllers/orders_controller.rb

	def create
    @food_item = FoodItem.find(params[:food_item_id])
    @order = @food_item.orders.create(order_params)
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "orders" ("name", "phone_number", "address", "quantity", "food_item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
	    @food_item = FoodItem.find(params[:food_item_id])
	    @order = @food_item.orders.find(params[:id])
	    @order.destroy
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."food_item_id" = $1 AND "orders"."id" = $2 LIMIT 1  [["food_item_id", 2], ["id", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 1]]

	def show
		@order = Order.find_by id: params[:id]
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]